# Реализовать класс Road (дорога), в котором определить атрибуты: length (длина), width (ширина). 
# Значения данных атрибутов должны передаваться при создании экземпляра класса.
# Атрибуты сделать защищенными. Определить метод расчета массы асфальта, необходимого для покрытия 
# всего дорожного полотна. Использовать формулу: длина*ширина*масса асфальта для покрытия одного 
# кв метра дороги асфальтом, толщиной в 1 см*число см толщины полотна. Проверить работу метода.
# Например: 20м5000м25кг*5см = 12500 т

def run():
    """Выполняет задание 2 для урока 6"""
    print("\r\nЗадание 2\r\n")



    print("Задание выполнено\r\n")
