# Создайте собственный класс-исключение, обрабатывающий ситуацию деления на нуль. 
# Проверьте его работу на данных, вводимых пользователем. При вводе пользователем 
# нуля в качестве делителя программа должна корректно обработать эту ситуацию и 
# не завершиться с ошибкой.

def run():
    """Выполняет задание № 2 к уроку 8"""
    print("\r\nЗадание 2\r\n")


    print("Задание выполнено")