# Реализовать проект «Операции с комплексными числами». Создайте класс «Комплексное число»,
# реализуйте перегрузку методов сложения и умножения комплексных чисел. Проверьте работу 
# проекта, создав экземпляры класса (комплексные числа) и выполнив сложение и умножение 
# созданных экземпляров. Проверьте корректность полученного результата.

def run():
    """Выполняет задание № 7 к уроку 8"""
    print("\r\nЗадание 7\r\n")


    print("Задание выполнено")