# Создать (программно) текстовый файл, записать в него программно набор чисел, разделенных 
# пробелами. Программа должна подсчитывать сумму чисел в файле и выводить ее на экран.

def run():
    """Выполняет задание 4 урока 6"""
    print("\r\nЗадание 6\r\n")



    print("Задение выполнено\r\n")

