# Создать текстовый файл (не программно), сохранить в нем несколько строк, 
# выполнить подсчет количества строк, количества слов в каждой строке.

def run():
    """Выполняет задание 2 урока 6"""
    print("\r\nЗадание 6\r\n")



    print("Задение выполнено\r\n")

