# Создать программно файл в текстовом формате, записать в него построчно данные, 
# вводимые пользователем. Об окончании ввода данных свидетельствует пустая строка.

def run():
    """Выполняет задание 1 урока 6"""
    print("\r\nЗадание 6\r\n")



    print("Задение выполнено\r\n")
