# Создать текстовый файл (не программно), построчно записать фамилии сотрудников и 
# величину их окладов (не менее 10 строк). Определить, кто из сотрудников имеет 
# оклад менее 20 тыс., вывести фамилии этих сотрудников. Выполнить подсчет средней 
# величины дохода сотрудников.
# Пример файла:
#   Иванов 23543.12 
#   Петров 13749.32
# Создать (не программно) текстовый файл со следующим содержимым:
#   One — 1
#   Two — 2
#   Three — 3
#   Four — 4
# Необходимо написать программу, открывающую файл на чтение и считывающую построчно 
# данные. При этом английские числительные должны заменяться на русские. Новый блок 
# строк должен записываться в новый текстовый файл.

def run():
    """Выполняет задание 3 урока 6"""
    print("\r\nЗадание 6\r\n")



    print("Задение выполнено\r\n")

